In [1]:
# import packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from ast import literal_eval

In [2]:
# reading in the csv file
df_budgets = pd.read_csv('/Users/jdapeman/Documents/Flatiron/microsoft_eda/data/tn.movie_budgets.csv')

In [3]:
np.round(df_budgets.describe(), decimals=1)

           id
count  5782.0
mean     50.4
std      28.8
min       1.0
25%      25.0
50%      50.0
75%      75.0
max     100.0

In [4]:
# sorting the data frame by movie title
df_budgets.sort_values(by=['movie'], inplace=True)

In [5]:
df_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5115,16,"Nov 20, 2015",#Horror,"$1,500,000",$0,$0
3954,55,"Jul 17, 2009",(500) Days of Summer,"$7,500,000","$32,425,665","$34,439,060"
4253,54,"Mar 11, 2016",10 Cloverfield Lane,"$5,000,000","$72,082,999","$108,286,422"
3447,48,"Nov 11, 2015",10 Days in a Madhouse,"$12,000,000","$14,616","$14,616"
3262,63,"Mar 31, 1999",10 Things I Hate About You,"$13,000,000","$38,177,966","$60,413,950"
...,...,...,...,...,...,...
1958,59,"Sep 15, 2017",mother!,"$30,000,000","$17,800,004","$42,531,076"
697,98,"Aug 9, 2002",xXx,"$70,000,000","$141,930,000","$267,200,000"
514,15,"Jan 20, 2017",xXx: Return of Xander Cage,"$85,000,000","$44,898,413","$345,033,359"
4756,57,"Apr 15, 2008",Ã l\'intÃ©rieur,"$3,000,000",$0,"$895,932"
2701,2,"Mar 7, 2008",é·æ±ä¸è (CJ7),"$20,000,000","$206,678","$47,300,771"

In [6]:
df_budgets.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5782 entries, 5115 to 2701
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 316.2+ KB

In [7]:
df_budgets['production_budget'] = df_budgets['production_budget'].str.replace(r'$', '')
df_budgets['production_budget'] = df_budgets['production_budget'].str.replace(r',', '')
df_budgets['production_budget'] = df_budgets['production_budget'].astype(int)

/var/folders/yd/tybxdv4901xbv_l8x4p1g7tm0000gn/T/ipykernel_38607/96240506.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_budgets['production_budget'] = df_budgets['production_budget'].str.replace(r'$', '')

In [8]:
df_budgets.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5782 entries, 5115 to 2701
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(2), object(4)
memory usage: 316.2+ KB

In [9]:
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace(r'$', '')
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace(r',', '')
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].astype(int)

/var/folders/yd/tybxdv4901xbv_l8x4p1g7tm0000gn/T/ipykernel_38607/3544728917.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace(r'$', '')

In [10]:
df_budgets.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5782 entries, 5115 to 2701
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   int64
 5   worldwide_gross    5782 non-null   object
dtypes: int64(3), object(3)
memory usage: 316.2+ KB

In [11]:
df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].str.replace(r'$', '')
df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].str.replace(r',', '')
df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].astype(int)

/var/folders/yd/tybxdv4901xbv_l8x4p1g7tm0000gn/T/ipykernel_38607/1886919089.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].str.replace(r'$', '')

In [12]:
df_budgets.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5782 entries, 5115 to 2701
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   int64
 5   worldwide_gross    5782 non-null   int64
dtypes: int64(4), object(2)
memory usage: 316.2+ KB

In [13]:
# dropping 'release_date' since we are focusing on profits not dates, and dropping 'id'
df_budgets = df_budgets.drop('release_date', axis=1) 
df_budgets = df_budgets.drop('id', axis=1)

In [14]:
df_budgets.head()

,movie,production_budget,domestic_gross,worldwide_gross
5115,#Horror,1500000,0,0
3954,(500) Days of Summer,7500000,32425665,34439060
4253,10 Cloverfield Lane,5000000,72082999,108286422
3447,10 Days in a Madhouse,12000000,14616,14616
3262,10 Things I Hate About You,13000000,38177966,60413950

In [15]:
np.round(df_budgets.describe(), decimals=1)

       production_budget  domestic_gross  worldwide_gross
count             5782.0          5782.0     5.782000e+03
mean          31587757.1      41873326.9     9.148746e+07
std           41812076.8      68240597.4     1.747200e+08
min               1100.0             0.0     0.000000e+00
25%            5000000.0       1429534.5     4.125415e+06
50%           17000000.0      17225945.0     2.798445e+07
75%           40000000.0      52348661.5     9.764584e+07
max          425000000.0     936662225.0     2.776345e+09

In [16]:
# only looking at the top 25% of profitable domestic movies 
df_budgets = df_budgets[df_budgets['domestic_gross'] > 52348661.5]

In [17]:
df_budgets.head()

                    movie  production_budget  domestic_gross  worldwide_gross
4253  10 Cloverfield Lane            5000000        72082999        108286422
350           10,000 B.C.          105000000        94784201        269065678
505        102 Dalmatians           85000000        66941559         66941559
2017           12 Monkeys           29000000        57141459        168841459
2517     12 Years a Slave           20000000        56671993        181025343

In [18]:
# rounding out by 5 decimal places
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].round(decimals=-5)
df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].round(decimals=-5)

In [19]:
# dropping duplicates
df_budgets = df_budgets.drop_duplicates(subset='movie')
boolean = df_budgets['movie'].duplicated().any()
boolean

False

In [20]:
# renaming the movie column to 'title'
df_budgets.rename(columns = {'movie' : 'title'}, inplace=True)

In [21]:
df_budgets

                    title  production_budget  domestic_gross  worldwide_gross
4253  10 Cloverfield Lane            5000000        72100000        108300000
350           10,000 B.C.          105000000        94800000        269100000
505        102 Dalmatians           85000000        66900000         66900000
2017           12 Monkeys           29000000        57100000        168800000
2517     12 Years a Slave           20000000        56700000        181000000
...                   ...                ...             ...              ...
1065     Zero Dark Thirty           52500000        95700000        134600000
2366           Zombieland           23600000        75600000        102200000
570             Zookeeper           80000000        80400000        170800000
156              Zootopia          150000000       341300000       1019400000
697                   xXx           70000000       141900000        267200000

[1431 rows x 4 columns]

In [22]:
df_budgets.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1431 entries, 4253 to 697
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title              1431 non-null   object
 1   production_budget  1431 non-null   int64
 2   domestic_gross     1431 non-null   int64
 3   worldwide_gross    1431 non-null   int64
dtypes: int64(3), object(1)
memory usage: 55.9+ KB

In [23]:
# saving the df_budgets to be moved to student.ipynb
df_budgets.to_csv('df_budgets.csv')